{
  "backend/main.mo": "Main actor implementing user profiles (with name, role, photo, studentId) and student directory (with id, name, className, photo) with authorization-based CRUD operations, blob storage integration, and migration support.",
  "backend/migration.mo": "Migration module that transforms old student and user profile records (without photo/studentId fields) to new schema by adding empty photo blobs and null studentId values.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including photo gallery, teacher profiles, exam results, and library management pages with their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages (home, students, announcements, schedules, events, fees, contact), components (layout, profile modal), hooks (useQueries), and configuration files.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with navy blue/gold educational theme for light and dark modes, including CSS custom properties for all UI components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, Apple-specific configuration, theme colors, and accessibility metadata for Phuba Government High School web app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata including name, icons (192x192, 512x512), theme colors, display mode (standalone), and education category for Phuba Government High School.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first strategy for API calls, with install/activate/fetch event handlers for offline support.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 12 routes (home, students, announcements, schedules, events, photos, teachers, exam-results, library, fees, contact, admin/contact-inbox) wrapped in ThemeProvider, Layout, ProfileSetupModal, and Toaster.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (desktop and mobile), authentication button, and footer with social links. Includes admin-only navigation links and handles login/logout flow.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and optional student ID. Automatically shows after login if no profile exists.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, students, announcements, schedules, events, teachers, exam results, library books, fees, and contact forms.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a navy blue and gold educational theme for both light and dark modes, including colors for backgrounds, text, borders, and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Displays a list of school announcements with authentication required. Admins can create new announcements via a dialog form, with real-time updates using React Query hooks.",
  "frontend/src/pages/ClassSchedulePage.tsx": "Shows class schedules organized by grade and section with filtering capabilities. Requires authentication and displays schedules in a grid layout with grade-based badges for filtering.",
  "frontend/src/pages/ContactInboxPage.tsx": "Admin-only inbox page for viewing and managing contact form submissions. Features status filtering (new/read/replied), message viewing dialog, status updates, and deletion functionality.",
  "frontend/src/pages/ContactPage.tsx": "Public contact form page allowing users to send messages to school administrators. Auto-fills user name if authenticated and submits contact forms with status tracking.",
  "frontend/src/pages/EventsPage.tsx": "Displays school events calendar with upcoming/past event badges and date/time formatting. Admins can create new events via dialog form with date picker functionality.",
  "frontend/src/pages/ExamResultsPage.tsx": "Displays and manages exam results with filtering by subject, allowing admins to add/edit/delete results and students to view their own results. Includes form dialogs for creating and updating exam records with fields like exam name, subject, grade, percentage, and date.",
  "frontend/src/pages/FeesPage.tsx": "Manages student fee records and payment transactions, showing outstanding balances and payment history. Admins can create/edit fee records and record payments, while students view their own fees and payment history.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section displaying school logo and name, plus feature cards linking to Students, Announcements, Schedules, and Events sections. Uses gradient backgrounds and responsive layout.",
  "frontend/src/pages/LibraryPage.tsx": "Library management system with book catalog, search functionality, and borrowing/return operations. Supports book CRUD operations with thumbnail uploads, tracks borrowing history, and displays current borrowed books with overdue status.",
  "frontend/src/pages/PhotoGalleryPage.tsx": "Photo gallery with category-based filtering (general, events, sports, etc.) and upload functionality for admins. Handles image uploads with progress tracking using ExternalBlob and allows photo deletion.",
  "frontend/src/pages/StudentDirectoryPage.tsx": "React page component that displays a searchable and filterable student directory with authentication checks, search by name/ID, class filtering, and displays student cards with details.",
  "frontend/src/pages/TeachersPage.tsx": "React page component for managing teacher profiles with admin-only CRUD operations, photo upload support with progress tracking, and displays teacher cards with subjects, qualifications, and contact information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors using OKLCH color space, custom border radius variables, font families, shadows, and keyframe animations for accordion components.",
  "project_state.json": "Project metadata file tracking schema version, architectural notes (PWA, RBAC, photo storage, payment gateway), image requirements, and existing features with their IDs and requirement mappings for Phuba Government High School interactive app."
}