{
  "kind": "build_request",
  "title": "Create Poumai Poems cultural literary section with admin management",
  "projectName": "Phuba Government High School",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Create a frontend Poumai Poems page (frontend/src/pages/PoumaiPoemsPage.tsx) displaying a collection of Poumai poems in a grid layout with category/theme filtering capability. Each poem card should display: title, author, poem text (with appropriate formatting for line breaks), date written, category/theme, and optional English translation with cultural/historical context.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-assistant-poumai-poems-build"
        ],
        "quotes": [
          "A dedicated Poumai Poems page displaying the collection in an elegant layout",
          "Each poem showing: title, author, the poem text, date written, category/theme, and optional English translation with cultural/historical context"
        ]
      },
      "acceptanceCriteria": [
        "Poumai Poems page displays poems in a responsive grid layout",
        "Category/theme filter allows users to filter poems by category",
        "Each poem card shows title, author, poem text with preserved formatting, date written, category, and optional English translation",
        "Cultural/historical context is displayed when available",
        "Page follows the existing navy and gold educational theme"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Implement backend Motoko data models and CRUD operations for Poumai poems in backend/main.mo. Create a Poem type with fields: id (Nat), title (Text), author (Text), poemText (Text), dateWritten (Text), category (Text), englishTranslation (?Text), culturalContext (?Text), createdBy (Principal), and timestamp (Int). Implement functions: createPoem (admin only), updatePoem (admin only), deletePoem (admin only), getPoem (public), listPoems (public), and listPoemsByCategory (public).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-assistant-poumai-poems-build"
        ],
        "quotes": [
          "Backend (Motoko) - Complete data models and CRUD operations with role-based access (public viewing, admin management)"
        ]
      },
      "acceptanceCriteria": [
        "Poem type includes all required fields with appropriate types",
        "Create, update, and delete operations require admin role",
        "All users can view poems and list poems",
        "List poems by category function filters poems correctly",
        "Poems are stored persistently with stable storage"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Create an admin interface within the Poumai Poems page for managing poems. Include a dialog form with fields for title, author, poem text (textarea with line break support), date written (date picker), category (dropdown or text input), optional English translation (textarea), and optional cultural context (textarea). Implement add, edit, and delete functionality accessible only to admin users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-assistant-poumai-poems-build"
        ],
        "quotes": [
          "Admin interface where authorized users can add, edit, and delete poems",
          "Full admin interface where authorized users can add, edit, and delete poems"
        ]
      },
      "acceptanceCriteria": [
        "Admin users see 'Add Poem' button on the Poumai Poems page",
        "Dialog form includes all required fields with appropriate input types",
        "Poem text textarea preserves line breaks and formatting",
        "Edit and delete buttons appear on poem cards for admin users",
        "Form validation ensures required fields are filled",
        "Success/error notifications appear after operations"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Add a 'Poumai Poems' navigation link to the Layout component (frontend/src/components/Layout.tsx) navigation menu. Style the link consistently with existing navigation items using the navy and gold educational theme. Add the route configuration to App.tsx with path '/poumai-poems'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-assistant-poumai-poems-build"
        ],
        "quotes": [
          "Navigation Integration - Adding 'Poumai Poems' link to your existing menu, styled with your navy and gold educational theme"
        ]
      },
      "acceptanceCriteria": [
        "Poumai Poems link appears in both desktop and mobile navigation menus",
        "Link styling matches existing navigation items",
        "Route is properly configured in App.tsx",
        "Clicking the link navigates to the Poumai Poems page"
      ]
    },
    {
      "id": "REQ-29",
      "text": "Create React Query hooks in frontend/src/hooks/useQueries.ts for Poumai poems operations: usePoems (fetch all poems), usePoemsByCategory (fetch poems by category), useCreatePoem (create new poem), useUpdatePoem (update existing poem), and useDeletePoem (delete poem). Ensure proper query invalidation after mutations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-assistant-poumai-poems-build"
        ],
        "quotes": [
          "Backend (Motoko) - Complete data models and CRUD operations with role-based access"
        ]
      },
      "acceptanceCriteria": [
        "All React Query hooks are properly typed with TypeScript",
        "Hooks handle loading and error states",
        "Mutations invalidate relevant queries to refresh data",
        "Hooks integrate with the backend actor from useActor hook"
      ]
    }
  ],
  "constraints": [
    "Maintain single-actor architecture in backend/main.mo",
    "Do not modify immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Use existing navy and gold educational theme colors from frontend/index.css",
    "Follow existing authentication and authorization patterns from other pages",
    "Use React Query for all data fetching and mutations"
  ],
  "nonGoals": [
    "Adding external poetry databases or APIs",
    "Implementing advanced text formatting beyond basic line breaks",
    "Adding audio recordings or multimedia for poems",
    "Creating public submission forms for poems (admin-only management)",
    "Implementing versioning or revision history for poems"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}