{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Create Poumai Poems cultural literary section with admin management",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Create Poumai Poems page displaying poems in a grid layout with category filtering",
      "acceptanceCriteria": [
        "Poumai Poems page displays poems in a responsive grid layout",
        "Category/theme filter allows users to filter poems by category",
        "Each poem card shows title, author, poem text with preserved formatting, date written, category, and optional English translation",
        "Cultural/historical context is displayed when available",
        "Page follows the existing navy and gold educational theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PoumaiPoemsPage.tsx",
          "operation": "create",
          "description": "Create the Poumai Poems page component that displays a collection of Poumai poems in a responsive grid layout. Include category/theme filtering using a dropdown or filter buttons. Each poem card should display title, author, poem text (with line breaks preserved using whitespace-pre-wrap CSS), date written, category/theme, and optional English translation with cultural/historical context. Use the usePoems and usePoemsByCategory hooks for data fetching. Apply the existing navy and gold educational theme from frontend/index.css. Include loading and error states. For admin users, show 'Add Poem' button and edit/delete actions on each card."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Create admin interface for managing poems with add, edit, and delete functionality",
      "acceptanceCriteria": [
        "Admin users see 'Add Poem' button on the Poumai Poems page",
        "Dialog form includes all required fields with appropriate input types",
        "Poem text textarea preserves line breaks and formatting",
        "Edit and delete buttons appear on poem cards for admin users",
        "Form validation ensures required fields are filled",
        "Success/error notifications appear after operations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PoumaiPoemsPage.tsx",
          "operation": "modify",
          "description": "Add admin-only dialog form for creating and editing poems within the PoumaiPoemsPage component. The dialog should include fields for: title (text input), author (text input), poem text (textarea with line break support), date written (date picker input), category (text input or dropdown with predefined categories like 'Traditional', 'Modern', 'Nature', 'Love', 'Historical'), optional English translation (textarea), and optional cultural context (textarea). Use the useCreatePoem, useUpdatePoem, and useDeletePoem hooks from useQueries.ts. Implement form validation to ensure required fields (title, author, poemText, dateWritten, category) are filled. Show success toast notifications after successful operations and error messages on failures. Add 'Edit' and 'Delete' buttons on each poem card that are only visible to admin users. Use the useInternetIdentity hook and backend isCallerAdmin method to check admin status."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add Poumai Poems navigation link and route configuration",
      "acceptanceCriteria": [
        "Poumai Poems link appears in both desktop and mobile navigation menus",
        "Link styling matches existing navigation items",
        "Route is properly configured in App.tsx",
        "Clicking the link navigates to the Poumai Poems page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add a 'Poumai Poems' navigation link to both the desktop navigation menu and the mobile navigation menu. Position it appropriately among the existing links (e.g., after Library). Style the link consistently with existing navigation items using the same className pattern and navy/gold theme colors. The link should navigate to '/poumai-poems'."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for the Poumai Poems page with path '/poumai-poems'. Import the PoumaiPoemsPage component and add it to the router configuration following the existing pattern. Ensure the route is accessible to all authenticated users."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Create React Query hooks for Poumai poems CRUD operations",
      "acceptanceCriteria": [
        "All React Query hooks are properly typed with TypeScript",
        "Hooks handle loading and error states",
        "Mutations invalidate relevant queries to refresh data",
        "Hooks integrate with the backend actor from useActor hook"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for Poumai poems operations: usePoems (fetch all poems using listPoems backend method), usePoemsByCategory (fetch poems by category using listPoemsByCategory backend method with category parameter), useCreatePoem (mutation for createPoem backend method), useUpdatePoem (mutation for updatePoem backend method), and useDeletePoem (mutation for deletePoem backend method). All hooks should use the actor from useActor hook and be properly typed with TypeScript using the Poem interface from backend.d.ts. Mutations should invalidate the 'poems' query key to refresh data after create/update/delete operations. Follow the existing pattern used for other queries in this file."
        }
      ]
    }
  ]
}